
; ==============================================================================
;       Проверочный код для вывода на экран самой мощной строки в истории
; ==============================================================================

        org     0
        mov     r1, 0x1700          ; Цвет фона
        mov     r2, str1            ; Источник строки
        mov     r3, 0xB8000         ; Видеопамять
        movs    r4, 1               ; +1
        movs    r5, 2               ; +2
@@:     movb    r6, [r2]            ; Прочесть байт
        and     r6, r6              ; Проверить на 0
stops:  je      stops               ; Если 0, то остановиться
        or      r6, r1              ; Добавить 17h в старшую часть
        movw    [r3], r6            ; Запись нового символа
        add     r2, r4              ; SI += 1
        add     r3, r5              ; DI += 2
        jr      @b                  ; Повтор

str1:   db      "HELLO WORLD!",0
